#include <stdio.h>
int main()
{
    // 印出 1 到 9 的奇数
    int i;
    /* 方法 1：使用朴素的 *2-1 算法
    for (i = 1; i <= 5; i++)
    {
        i = i * 2 - 1;
        printf("%d\n", i);
    }*/
    /* 方法 2：使用不那么朴素但也精致不到哪儿去的 n+2 算法
    for (i = 1; i <= 9; i += 2)
    {
        printf("%d\n", i);
    }*/
    // 方法 3：使用 if 述句判断奇偶
    // 老师说，这种方法“最有弹性”
    for (i = 1; i <= 10; i++)
    {
        if (i % 2 == 1)
        {
            printf("%d\n", i);
        }
    }
    // 再印出 2 到 10 的偶数
    for (i = 1; i <= 10; i++)
    {
        if (i % 2 == 0)
        {
            printf("%d\n", i);
        }
    }
    // 接着印出 1 到 10 间不是 3 的倍数的偶数
    for (i = 1; i <= 10; i++)
    {
        if (i % 3 != 0 && i % 2 == 0)
        {
            printf("%d\n", i);
        }
    }
    return 0;
}