#include <stdio.h>

int main () {
    int v[3] = {2, 1, 3};
    int *n = v; // 只存首项位址
    int *p[3] = {&v[0], &v[1], &v[2]}; // 全存了
    /* 指标阵列的一些应用场景 */
    // 1. 可以按自定义的顺序存取
    int *q[3] = {&v[2], &v[1], &v[0]};
    // 2. 可以索引一些相同型别但互不相干的变数的位址
        // 索引多个变数的位址
    int a = 2, b = 1, c = 3;
    int *r[3] = {&a, &b, &c};
        // 索引多个阵列开头的位址
    int x[2], y[2], z[2];
    int *s[3] = {x, y, z};
    for (int i = 0; i < 3; i++) {
        for (int j = 0; j < 2; j++) {
            s[i][j] = 0;
            printf("%d ", s[i][j]);
        }
    }
    return 0;
}